package ir.nimbo2.nimroo.cooler.Processors;

import org.junit.Test;

import static org.junit.Assert.*;

public class NewsProcessorTest {

    @Test
    public void getNewsTest() {
        String news = "به گزارش خبرگزاری فارس و به نقل از سایت فدراسیون کاراته، طبق برنامه اعلام شده از سوی سازمان لیگ فدراسیون، چهاردهمین دوره سوپر لیگ کاراته مردان و دوازدهمین دوره سوپر لیگ بانوان شهریورماه آغاز می\u200Cشود." + " "
                + "بر این اساس تیم\u200Cها برای شرکت در لیگ تا پایان وقت اداری چهارشنبه 28 تیرماه فرصت دارند اعلام آمادگی کنند." + " "
                + "سوپر لیگ امسال در بخش بانوان در اوزان 50- ،آزاد اول (زیر 61 کیلوگرم)، 55-، 61-،آزاد دوم (بالای 61 کیلوگرم)، 68 - و آزاد سوم" + " "
                + "و در بخش مردان در اوزان 60-، آزاد اول (زیر 75 کیلوگرم)، 67-، 75-، آزاد دوم (بالای 75 کیلوگرم)، 84- و آزاد سوم برگزار خواهد شد." + " "
                + "در بخش کومیته هر برد سه امتیاز و هر مساوی یک امتیاز دارد." + " "
                + "در کاتای انفرادی هر مسابقه سه امتیاز دارد. در صورتی که برد پرچم 3 – 2 باشد تقسیم امتیازات به صورت دو امتیاز برای برنده و یک امتیاز برای بازنده خواهد بود و در بخش تیمی هر مسابقه دارای 5 امتیاز است و در صورتی که برد با پرچم 3-2 باشد تقسیم امتیازات 3 امتیاز برای برنده و 2 امتیاز برای بازنده است." + " "
                + "انتهای پیام/س";
        assertEquals(news, NewsProcessor.getNews("https://www.farsnews.com/news/13970420000614/%D8%A2%D8%AE%D8%B1%D9%8A%D9%86-%D9%81%D8%B1%D8%B5%D8%AA-%D8%AD%D8%B6%D9%88%D8%B1-%D8%AF%D8%B1-%D8%B3%D9%88%D9%BE%D8%B1-%D9%84%D9%8A%DA%AF-%D9%83%D8%A7%D8%B1%D8%A7%D8%AA%D9%87-%D8%A7%D8%B9%D9%84%D8%A7%D9%85-%D8%B4%D8%AF", "4#0#1#0#5#0"));
        assertEquals(news, NewsProcessor.getNews("https://www.farsnews.com/news/13970420000614/%D8%A2%D8%AE%D8%B1%D9%8A%D9%86-%D9%81%D8%B1%D8%B5%D8%AA-%D8%AD%D8%B6%D9%88%D8%B1-%D8%AF%D8%B1-%D8%B3%D9%88%D9%BE%D8%B1-%D9%84%D9%8A%DA%AF-%D9%83%D8%A7%D8%B1%D8%A7%D8%AA%D9%87-%D8%A7%D8%B9%D9%84%D8%A7%D9%85-%D8%B4%D8%AF", "span[id=nwstxtBodyPane]"));
        assertEquals(news, NewsProcessor.getNews("https://www.farsnews.com/news/13970420000614/%D8%A2%D8%AE%D8%B1%D9%8A%D9%86-%D9%81%D8%B1%D8%B5%D8%AA-%D8%AD%D8%B6%D9%88%D8%B1-%D8%AF%D8%B1-%D8%B3%D9%88%D9%BE%D8%B1-%D9%84%D9%8A%DA%AF-%D9%83%D8%A7%D8%B1%D8%A7%D8%AA%D9%87-%D8%A7%D8%B9%D9%84%D8%A7%D9%85-%D8%B4%D8%AF", "div[class=nwstxtmainpane]#0"));
        assertEquals(news, NewsProcessor.getNews("https://www.farsnews.com/news/13970420000614/%D8%A2%D8%AE%D8%B1%D9%8A%D9%86-%D9%81%D8%B1%D8%B5%D8%AA-%D8%AD%D8%B6%D9%88%D8%B1-%D8%AF%D8%B1-%D8%B3%D9%88%D9%BE%D8%B1-%D9%84%D9%8A%DA%AF-%D9%83%D8%A7%D8%B1%D8%A7%D8%AA%D9%87-%D8%A7%D8%B9%D9%84%D8%A7%D9%85-%D8%B4%D8%AF", "div[class=container mainframe]#1#0#5#0"));
    }

    @Test
    public void getNewsTest2() {
        String news2 = "مهدی قاسمی مسئول گروه جهادی انجمن اسلامی دانشجویان مستقل دانشگاه یاسوج در گفتگو با خبرنگار گروه دانشگاه خبرگزاری یاسوج گفت: گروه جهادی مرحوم معین با بیش از ۲۵ جهادگر خواهر و برادر به روستای چاهن زیلایی اعزام و اقدام به خدمت رسانی در بخش های، عمرانی، فرهنگی و آموزشی می\u200Cکند.\n" +
                "\n" +
                "مهدی قاسمی با بیان اینکه بیش از ۶ روز است که گروه ما در این روستا مستقر است مطرح کرد: در این ۶ روز دوستان ما در حوزه عمرانی اقدام به دیوارکشی حیاط مسجد روستا، رنگ آمیزی مدرسه کردند که البته بخشی از کار\u200Cها رو بر عهده مردم روستا گذاشتیم که انشالله بعد از ما کار\u200Cهای مونده را انجام خواهند داد، و ما هم هر کمکی از دستمان بر بیاید دریغ نخواهیم کرد.\n" +
                "\n" +
                "مسئول گروه جهادی انجمن اسلامی دانشجویان مستقل دانشگاه یاسوج خاطر نشان کرد: عمده هدف و تمرکز اصلی اردوی جهادی ما بر روی مسائل فرهنگی است و در این مدت هم خدا رو شکر توانستیم تا حدودی اقدامات مؤثری انجام دهیم.\n" +
                "\n" +
                "وی در ادامه افزود: برگزاری کلاس\u200Cهای آموزشی صنایع دستی، آموزش قرآن و احکام، کلاس\u200Cهای تقویتی و آموزشی مختص دانش آموزان، کلاس سرود، سرکشی به منازل خانواده شهدا، برپایی مراسم شهادت امام جعفر صادق (ع) و ... از جمله اقدامات فرهنگی گروه جهادی مرحوم معین تا به این لحظه بوه است.\n" +
                "\n" +
                "مهدی قاسمی  در رابطه  به ورود افراد غیر متفکرانه که باعث بدبینی مردم و لطمه خوردن فرهنگ و بافت روستائیان می\u200Cشود بیان کرد: در یکی از اردوی\u200Cهایی که از کلان شهر کشور به همین منطقه اعزام شده بود، با دیدن محرومیت و کمبود امکانات مردم اقدام به تشویق آن\u200Cها برای مهاجرت به شهر و شهرنشینی می\u200Cکردند؛ کما اینکه یکی ازبزرگترین آسیب\u200Cهای اجتماعی که ما در شهر\u200Cها با آن روبرو هستیم، همین حاشیه نشینی شهر هاست که با مهاجرت غیراصولی به وجود آمده است.\n" +
                " \n" +
                "مسئول گروه جهادی انجمن اسلامی دانشجویان مستقل دانشگاه یاسوج  تصریح کرد: باید این مسئله را مد نظر داشته باشیم که ورود ما نباید به فرهنگ روستانشینی و زندگی روستایی مردم آسیب بزند؛ و زندگی شهرنشینی را تجملی و زیبا جلوه دهیم تا برای زندگی بهتر به شهر مهاجرت کنند.\n" +
                "\n" +
                "وی در خصوص کمک بسیج دانشجویی برای اعزام اردوی جهادی معین گفت: از شهرام مهدوی مطلق مسئول بسیج دانشجویی استان و همچنین معاونت سازندگی این ناحیه به خاطر همکاری که با گروه جهادی ما داشتند تشکر و قدردانی میکنم، و چه بسا اگر همکاری بسیج دانشجویی نبود کار ما با سختی\u200Cها و مشکلات فراوانی همراه می\u200Cبود.";
        news2 = news2.replaceAll("\n", "");
        news2 = news2.replaceAll(" ", "");
        news2 = news2.replace("\u00a0", "");
        assertEquals(news2, NewsProcessor.getNews("http://snn.ir/fa/news/696974/%D8%AF%D8%A7%D9%86%D8%B4%D8%AC%D9%88%DB%8C%D8%A7%D9%86-%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87-%DB%8C%D8%A7%D8%B3%D9%88%D8%AC-%D8%A8%D9%87-%DA%A9%D9%85%DA%A9-%D9%85%D8%AD%D8%B1%D9%88%D9%85%DB%8C%D9%86-%D8%B4%D8%AA%D8%A7%D9%81%D8%AA%D9%86%D8%AF",
                "div[class=body body_news_search]").replace(" ", "").replace("\u00a0", ""));
        assertEquals(news2, NewsProcessor.getNews("http://snn.ir/fa/news/696974/%D8%AF%D8%A7%D9%86%D8%B4%D8%AC%D9%88%DB%8C%D8%A7%D9%86-%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87-%DB%8C%D8%A7%D8%B3%D9%88%D8%AC-%D8%A8%D9%87-%DA%A9%D9%85%DA%A9-%D9%85%D8%AD%D8%B1%D9%88%D9%85%DB%8C%D9%86-%D8%B4%D8%AA%D8%A7%D9%81%D8%AA%D9%86%D8%AF",
                "div[style=text-align: justify;padding: 10px;]").replace(" ", "").replace("\u00a0", ""));
        assertEquals(news2, NewsProcessor.getNews("http://snn.ir/fa/news/696974/%D8%AF%D8%A7%D9%86%D8%B4%D8%AC%D9%88%DB%8C%D8%A7%D9%86-%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87-%DB%8C%D8%A7%D8%B3%D9%88%D8%AC-%D8%A8%D9%87-%DA%A9%D9%85%DA%A9-%D9%85%D8%AD%D8%B1%D9%88%D9%85%DB%8C%D9%86-%D8%B4%D8%AA%D8%A7%D9%81%D8%AA%D9%86%D8%AF",
                "1#0#0#2#3").replace(" ", "").replace("\u00a0", ""));
    }
}